{
  "cover_image": "https://9anime.org.lv/wp-content/uploads/2025/06/The-Fragrant-Flower-Blooms-with-Dignity.webp",
  "name": "The Fragrant Flower Blooms with Dignity",
  "vietnamese_name": "Hoa Thơm Kiêu Hãnh",
  "japanese_name": "Kaoru Hana wa Rin to Saku",
  "description": "Mặc dù nằm cạnh nhau, trường Trung học Công lập Chidori và Học viện Nữ sinh Tư thục Kikyo dường như thuộc về hai thế giới khác biệt. Trong khi Kikyo nổi tiếng với danh tiếng hoàn hảo và ưu ái những học sinh xuất thân từ gia đình giàu có, thì Chidori lại là một \"ổ\" của những học sinh cá biệt. Tất cả mọi người ở Kikyo đều có một sự căm ghét sâu sắc đối với những người hàng xóm Chidori của họ.\nCậu thiếu niên mười sáu tuổi Tsumugi Rintarou là học sinh tại Chidori, người có vẻ ngoài đáng sợ khiến mọi người xa lánh. Rintarou không bận tâm đến điều này, vì cậu đã hài lòng với nhóm bạn của mình. Tuy nhiên, có một điều cậu vẫn chưa nói với họ: thỉnh thoảng, cậu phụ giúp tại tiệm bánh của gia đình.\nMột ngày nọ tại nơi làm việc, Rintarou nhìn thấy một khách hàng nhưng cô ấy đã bỏ chạy trước khi cậu kịp nói chuyện. Ngày hôm sau, cậu nhận được lời xin lỗi từ cô gái đó, Waguri Kaoruko, người giải thích rằng cô không bỏ chạy vì ngoại hình của cậu và cô tin rằng Rintarou là một người tốt bụng. Mặc dù không quen với tính cách tươi sáng của Kaoruko, Rintarou vẫn mong muốn được kết bạn với cô. Chỉ có một trở ngại duy nhất trên con đường của cậu: \"Kaoruko là một học sinh của Kikyo\".",
  "episodes": [
    {
      "episode_number": "1",
      "player_link": "https://short.icu/I1lcZlqmC"
    },
    {
      "episode_number": "2",
      "player_link": "https://short.icu/scK2Jw82x"
    },
    {
      "episode_number": "3",
      "player_link": "https://short.icu/vhmFhpe2J"
    },
    {
      "episode_number": "4",
      "player_link": "https://short.icu/Yr7oqeScj"
    },
    {
      "episode_number": "5",
      "player_link": "https://short.icu/k3LNaxpiv"
    },
    {
      "episode_number": "6",
      "player_link": ""
    },
    {
      "episode_number": "7",
      "player_link": ""
    },
    {
      "episode_number": "8",
      "player_link": ""
    },
    {
      "episode_number": "9",
      "player_link": ""
    },
    {
      "episode_number": "10",
      "player_link": ""
    },
    {
      "episode_number": "11",
      "player_link": ""
    },
    {
      "episode_number": "12",
      "player_link": ""
    },
    {
      "episode_number": "13",
      "player_link": ""
    }
  ]
}